alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// --- AP picker screen ---
#define AP_ROW_H  24   // height of each AP list row

// Convert RSSI to 4-char ASCII signal bar string.
static const char* rssiToBars(int rssi) {
    if (rssi >= -55) return "####";
    if (rssi >= -65) return "###.";
    if (rssi >= -75) return "##..";
    if (rssi >= -85) return "#...";
    return "....";
}

// Draw full-screen AP list. apCount entries from apSsids[]/apRssi[].
// Rows numbered 1–apCount starting at y=AP_ROW_H (row 0 = header).
void drawAPList(const char apSsids[][33], const int* apRssi, int apCount) {
    uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
    uint16_t fg = invertDisplay ? TFT_BLACK : TFT_WHITE;
    tft.fillScreen(bg);
    fontOff();
    uiFontOn();
    // Header row
    tft.setTextColor(fg, bg);
    tft.setCursor(2, (AP_ROW_H - TXT_H) / 2);
    tft.print("Select WiFi network:");
    // Entry rows
    for (int i = 0; i < apCount; i++) {
        int y = AP_ROW_H * (i + 1);
        tft.fillRect(0, y, SCREEN_W, AP_ROW_H - 1, COL_KEY_FACE);
        tft.setTextColor(COL_KEY_LABEL, COL_KEY_FACE);
        int ty = y + (AP_ROW_H - TXT_H) / 2;
        // Number
        char num[3]; snprintf(num, sizeof(num), "%d", i + 1);
        tft.setCursor(2, ty); tft.print(num);
        // SSID (truncated to fit before signal column)
        int sigX = SCREEN_W - 9 * TXT_W;
        int ssidMaxChars = (sigX - 2*TXT_W - 8) / TXT_W;
        if (ssidMaxChars > 22) ssidMaxChars = 22;
        char ssidDisp[23] = {0};
        strncpy(ssidDisp, apSsids[i], ssidMaxChars);
        tft.setCursor(2 + TXT_W, ty); tft.print(ssidDisp);
        // Signal bars + dBm (right side)
        char sig[12];
        snprintf(sig, sizeof(sig), "%s %4d", rssiToBars(apRssi[i]), apRssi[i]);
        tft.setCursor(sigX, ty); tft.print(sig);
    }
    uiFontOff();
}

// --- WiFi health ---
bool          wifiHealthy     = true;
unsigned long lastWiFiCheckMs = 0;

// --- Input buffer ---
char inputBuf[INPUT_BUF_SIZE] = {0};
int  inputLen      = 0;
bool moreMode      = false;  // true after AI reply → button shows "More"

void drawInputBar() {
#ifdef TARGET_C3
    // On C3 the input prompt is the last line of the chat area (no separate bar).
    // drawHistory() renders it as part of the history display; this function
    // redraws just that last slot when only the input text changes.
    {
        int lineH  = LINE_H_LARGE;
        int inputY = (HIST_H_KB_HIDE / lineH - 1) * lineH;
        uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
        TFT_eSprite spr(&tft);
        spr.setColorDepth(16);
        if (spr.createSprite(SCREEN_W, lineH)) {
            FONT_LOAD(spr);
            spr.fillSprite(bg);
            spr.setTextColor(wifiHealthy ? TFT_DARKGREY : TFT_RED, bg);
            spr.drawString("> ", 2, 0);
            int promptW = spr.textWidth("> ");
            spr.setTextColor(invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
            int availW = SCREEN_W - promptW - 4;
            int start = 0;
            if (inputLen > 0) {
                start = inputLen;
                while (start > 0) {
                    char tmp[INPUT_BUF_SIZE];
                    strncpy(tmp, inputBuf + start - 1, inputLen - start + 1);
                    tmp[inputLen - start + 1] = '\0';
                    if (spr.textWidth(tmp) > availW) break;
                    start--;
                }
            }
            char dispBuf[INPUT_BUF_SIZE] = {0};
            strncpy(dispBuf, inputBuf + start, inputLen - start);
            spr.drawString(dispBuf, 2 + promptW, 0);
            FONT_UNLOAD(spr);
            spr.pushSprite(0, inputY);
            spr.deleteSprite();
        } else {
            // Direct fallback
            tft.fillRect(0, inputY, SCREEN_W, SCREEN_H - inputY, bg);
            fontOn();
            tft.setTextColor(wifiHealthy ? TFT_DARKGREY : TFT_RED, bg);
            tft.drawString("> ", 2, inputY);
            int promptW = tft.textWidth("> ");
            tft.setTextColor(invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
            int maxChars = (SCREEN_W - (int)promptW - 4) / TXT_W;
            char dispBuf[INPUT_BUF_SIZE] = {0};
            int start = (inputLen > maxChars) ? inputLen - maxChars : 0;
            strncpy(dispBuf, inputBuf + start, inputLen - start);
            tft.drawString(dispBuf, 2 + promptW, inputY);
            fontOff();
        }
        return;
    }
#endif
    // CYD28: traditional input bar at bottom of screen
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;

    tft.fillRect(0, barY, SCREEN_W, barH, COL_IBAR_BG);

    // Ensure smooth font is cleared — rebuildLines may leave it loaded on tft
    FONT_UNLOAD(tft);
    tft.setTextFont(1);

    // Prompt marker — red when WiFi health check fails
    tft.setTextColor(wifiHealthy ? COL_IBAR_TEXT : TFT_RED, COL_IBAR_BG);
    uiFontOn();
    tft.setCursor(2, barY + (barH - TXT_H) / 2);
    tft.print("> ");
    tft.setTextColor(COL_IBAR_TEXT, COL_IBAR_BG);

    int maxChars = (SCREEN_W - BTN_SEND_W - 14) / TXT_W;
    char display[54] = {0};
    int start = (inputLen > maxChars) ? inputLen - maxChars : 0;
    strncpy(display, inputBuf + start, maxChars);
    tft.print(display);

    // Button
    tft.fillRect(SCREEN_W - BTN_SEND_W, barY + BTN_INSET, BTN_SEND_W - BTN_INSET*2, barH - BTN_INSET*2, COL_BTN_BG);
    tft.setTextColor(wifiHealthy ? COL_BTN_TEXT : TFT_RED, COL_BTN_BG);
    const char* btnLbl = moreMode ? "More" : "Send";
    int bw = tft.textWidth(btnLbl);
    tft.drawString(btnLbl, SCREEN_W - BTN_SEND_W + (BTN_SEND_W - bw) / 2, barY + (barH - TXT_H) / 2);
    uiFontOff();

    if (!kbVisible) {
        tft.fillRect(SCREEN_W - BTN_SHOWKB_X, barY + BTN_INSET, BTN_SHOWKB_W, barH - BTN_INSET*2, COL_BTN_BG);
        tft.setTextColor(COL_BTN_TEXT, COL_BTN_BG);
        tft.setCursor(SCREEN_W - BTN_SHOWKB_X + 3, barY + (barH - 8) / 2);
        tft.print("Show KB");

        tft.fillRect(SCREEN_W - BTN_NEW_X, barY + BTN_INSET, BTN_NEW_W, barH - BTN_INSET*2, COL_BTN_BG);
        tft.setTextColor(COL_BTN_TEXT, COL_BTN_BG);
        tft.setCursor(SCREEN_W - BTN_NEW_X + 4, barY + (barH - 8) / 2);
        tft.print("New");
    }
}

