alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// --- Conversation history ---
struct Message {
    bool   isUser;
    bool   isError;
    bool   displayOnly;  // true = show in chat but never sent to AI
    char   text[2048];
};

#ifdef TARGET_C3
static const int  MAX_MESSAGES = 10;   // reduced from 20 to free heap for TLS+BLE coexistence
#else
static const int  MAX_MESSAGES = 20;
#endif
Message           history[MAX_MESSAGES];
int               historyCount = 0;

// Rendered line cache
#ifdef TARGET_C3
static const int  MAX_LINES  = 100;       // reduced from 250 to free heap for TLS+BLE coexistence
#else
static const int  MAX_LINES  = 250;
#endif
char              lines[MAX_LINES][128];  // 127 bytes + null per line (UTF-8 safe)
uint16_t          lineColor[MAX_LINES];
bool              lineIsUser[MAX_LINES];  // true = right-align (user message)
int               lineCount    = 0;
int               scrollOffset = 0;       // lines scrolled up from bottom

void rebuildLines() {
    lineCount = 0;
    for (int m = 0; m < historyCount && lineCount < MAX_LINES - 2; m++) {
        uint16_t col = history[m].isError ? COL_ERROR :
                       history[m].isUser  ? COL_USER  : COL_AI;
        bool isUser = history[m].isUser;
        const char* full = history[m].text;

        {
            // Pixel-width word wrap using smooth font (DejaVuSansBold12px)
            fontOn();
            char lineBuf[128] = "";
            const char* p = full;
            while (*p && lineCount < MAX_LINES - 1) {
                if (*p == '\n') {
                    if (lineBuf[0]) {
                        strncpy(lines[lineCount], lineBuf, 127);
                        lines[lineCount][127] = '\0';
                        lineColor[lineCount] = col; lineIsUser[lineCount++] = isUser;
                        lineBuf[0] = '\0';
                    }
                    p++;
                    continue;
                }
                const char* ws = p;
                while (*p && *p != ' ' && *p != '\n') p++;
                int wlen = p - ws;
                if (wlen <= 0) { if (*p) p++; continue; }
                char word[128];
                strncpy(word, ws, min(wlen, 127));
                word[min(wlen, 127)] = '\0';
                if (*p == ' ') p++;
                char test[260];
                if (lineBuf[0]) snprintf(test, 260, "%s %s", lineBuf, word);
                else            { strncpy(test, word, 127); test[127] = '\0'; }
                if (tft.textWidth(test) <= SCREEN_W - 4) {
                    strncpy(lineBuf, test, 127); lineBuf[127] = '\0';
                } else {
                    if (lineBuf[0]) {
                        strncpy(lines[lineCount], lineBuf, 127);
                        lines[lineCount][127] = '\0';
                        lineColor[lineCount] = col; lineIsUser[lineCount++] = isUser;
                        strncpy(lineBuf, word, 127); lineBuf[127] = '\0';
                    } else {
                        strncpy(lines[lineCount], word, 127);
                        lines[lineCount][127] = '\0';
                        lineColor[lineCount] = col; lineIsUser[lineCount++] = isUser;
                    }
                }
            }
            if (lineBuf[0] && lineCount < MAX_LINES) {
                strncpy(lines[lineCount], lineBuf, 127);
                lines[lineCount][127] = '\0';
                lineColor[lineCount] = col; lineIsUser[lineCount++] = isUser;
            }
            fontOff();
        }
    }
}

void drawHistory() {
    int histH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
    uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
    int lineH  = LINE_H_LARGE;
    int maxVis = histH / lineH;

    // On C3: slot 0 = model heading, last slot = inline input prompt.
    int histSlots = maxVis;
#ifdef TARGET_C3
    histSlots = maxVis - 2;
#endif
    int firstIdx = lineCount - histSlots - scrollOffset;
    if (firstIdx < 0) firstIdx = 0;

#ifdef TARGET_C3
    // Render each line to a RAM sprite, then push to display in one SPI block.
    // This avoids repeated setWindow/pushBlock transitions that cause partial
    // screen updates on ESP32-C3 (SPI register sync issue without DMA).
    // Falls back to direct TFT drawing if heap is too fragmented.
    TFT_eSprite spr(&tft);
    spr.setColorDepth(16);

    // Pre-fill background before any sprite push.
    tft.fillRect(0, 0, SCREEN_W, histH, bg);

    // Slot 0: model heading — lineH+4 tall to avoid clipping descenders (g, q, y).
    // Drawn in its own create/delete pass so no two sprites are alive simultaneously.
    if (spr.createSprite(SCREEN_W, lineH + 4)) {
        FONT_LOAD(spr);
        const char* modelLabel = useGrok ? "Grok 4.1 Fast" :
                                 useGroq ? "Groq OSS-120b" : GEMINI_MODEL;
        spr.fillSprite(bg);
        spr.setTextColor(invertDisplay ? TFT_DARKGREEN : TFT_GREEN, bg);
        spr.drawString(modelLabel, 2, 0);
        FONT_UNLOAD(spr);
        spr.pushSprite(0, 0);
        spr.deleteSprite();
    }

    if (spr.createSprite(SCREEN_W, lineH)) {
        FONT_LOAD(spr);
        spr.setTextWrap(false);

        for (int i = 0; i < histSlots; i++) {
            spr.fillSprite(bg);
            if ((firstIdx + i) < lineCount) {
                int idx = firstIdx + i;
                uint16_t col = lineColor[idx];
                if (invertDisplay && col != COL_ERROR) {
                    col = lineIsUser[idx] ? COL_USER_LIGHT : TFT_BLACK;
                }
                spr.setTextColor(col, bg);
                if (lineIsUser[idx]) {
                    spr.setTextDatum(TR_DATUM);
                    spr.drawString(lines[idx], SCREEN_W, 0);
                    spr.setTextDatum(TL_DATUM);
                } else {
                    spr.drawString(lines[idx], 2, 0);
                }
            }
            spr.pushSprite(0, (i + 1) * lineH);  // +1: slot 0 is the heading
        }

        // Input line — always the last visible slot
        {
            spr.fillSprite(bg);
            spr.setTextColor(wifiHealthy ? TFT_DARKGREY : TFT_RED, bg);
            spr.drawString("> ", 2, 0);
            int promptW = spr.textWidth("> ");
            spr.setTextColor(invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
            int availW = SCREEN_W - promptW - 4;
            int start = 0;
            if (inputLen > 0) {
                start = inputLen;
                while (start > 0) {
                    char tmp[INPUT_BUF_SIZE];
                    strncpy(tmp, inputBuf + start - 1, inputLen - start + 1);
                    tmp[inputLen - start + 1] = '\0';
                    if (spr.textWidth(tmp) > availW) break;
                    start--;
                }
            }
            char dispBuf[INPUT_BUF_SIZE] = {0};
            strncpy(dispBuf, inputBuf + start, inputLen - start);
            spr.drawString(dispBuf, 2 + promptW, 0);
            spr.pushSprite(0, (maxVis - 1) * lineH);  // last slot, after heading + histSlots chat lines
        }

        FONT_UNLOAD(spr);
        spr.deleteSprite();

