alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
void sendPrompt();  // forward declaration — defined after callGemini()

// Set LED colour based on WiFi RSSI (called after every health check)
// Blue ≥-55  Cyan ≥-65  Green ≥-75  Orange=weak-but-connected  Red=lost
void updateLedWifi() {
    if (WiFi.status() != WL_CONNECTED) {
        halSetLed(255, 0, 0);   // Red: WiFi lost
        return;
    }
    int rssi = WiFi.RSSI();
    if      (rssi >= RSSI_THRESH_BLUE)  halSetLed(  0,   0, 255);  // Blue:   strongest
    else if (rssi >= RSSI_THRESH_CYAN)  halSetLed(  0, 255, 255);  // Cyan:   good
    else if (rssi >= RSSI_THRESH_GREEN) halSetLed(  0, 255,   0);  // Green:  fair
    else                  halSetLed(255, 128,   0);  // Orange: weak
}

// --- WiFi ---
// Returns true if connected. Pass showSplash=true for boot (draws title + "Connecting:" text).
bool connectWiFi(const char* ssid, const char* pass, bool showSplash = false) {
    if (showSplash) {
        fontOn();
        tft.setTextColor(TFT_NAVY, TFT_WHITE);
        char wifiMsg[80];
        snprintf(wifiMsg, sizeof(wifiMsg), "Connecting: %.55s...", ssid);
        tft.drawString(wifiMsg, 2, 0);
        fontOff();
    }
    WiFi.mode(WIFI_STA);
    WiFi.begin(ssid, pass);
    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < WIFI_MAX_ATTEMPTS) {
        delay(WIFI_RETRY_DELAY_MS);
        attempts++;
    }
    if (showSplash) tft.fillRect(0, 0, SCREEN_W, LINE_H_LARGE + 2, TFT_WHITE);
#ifdef TARGET_C3
    WiFi.setSleep(true);  // modem sleep: yields radio to BLE between beacons
#endif
    updateLedWifi();
    return WiFi.status() == WL_CONNECTED;
}

// Scan WiFi, let user pick an AP, handle password entry, connect.
// Loops until connected. Call from setup() when connectWiFi() returns false.
void selectAP() {
    while (true) {  // outer: re-scan loop
        // --- Scan ---
        WiFi.disconnect(true);  // ensure clean idle state before scan (prev. begin() may leave driver busy)
        {
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillScreen(bg);
            fontOff(); uiFontOn(); tft.setTextColor(invertDisplay ? TFT_BLACK : TFT_YELLOW, bg);
            tft.drawString("Scanning WiFi...", 2, 0);
        }

        int n = WiFi.scanNetworks();

        if (n <= 0) {
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillScreen(bg);
            tft.setTextColor(invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
            tft.drawString("No networks found. Tap to retry.", 2, 0);
            { InputEvent ev; while (!halPollInput(&ev)) delay(10); }
            continue;
        }

        // Sort indices by RSSI descending, keep top 9
        int indices[40];
        int total = (n < 40) ? n : 40;
        for (int i = 0; i < total; i++) indices[i] = i;
        for (int i = 0; i < total - 1; i++) {
            for (int j = i + 1; j < total; j++) {
                if (WiFi.RSSI(indices[j]) > WiFi.RSSI(indices[i])) {
                    int tmp = indices[i]; indices[i] = indices[j]; indices[j] = tmp;
                }
            }
        }
        int apCount = (total < 9) ? total : 9;

        char apSsids[9][33];
        int  apRssi[9];
        for (int i = 0; i < apCount; i++) {
            strncpy(apSsids[i], WiFi.SSID(indices[i]).c_str(), 32);
            apSsids[i][32] = '\0';
            apRssi[i] = WiFi.RSSI(indices[i]);
        }
        WiFi.scanDelete();

        drawAPList(apSsids, apRssi, apCount);

        // --- Wait for AP selection ---
        int selected = -1;
        while (selected < 0) {
            InputEvent ev;
            if (!halPollInput(&ev)) { delay(10); continue; }
            if (ev.type == INPUT_CHAR && ev.ch >= '1' && ev.ch <= '9') {
                int idx = ev.ch - '1';
                if (idx < apCount) selected = idx;
            }
        }

        char selSsid[33];
        strncpy(selSsid, apSsids[selected], 32); selSsid[32] = '\0';

        // --- Password + connect loop for this AP ---
        while (true) {
            char pass[64] = {0};
            bool hasStored = findWifiPass(selSsid, pass);

            if (!hasStored) {
                enterPassword(selSsid, pass);
            }

            // Show connecting
            uint16_t conBg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillScreen(conBg);
            uiFontOn(); tft.setTextColor(TFT_BLUE, conBg);
            char msg[80]; snprintf(msg, sizeof(msg), "Connecting: %.55s...", selSsid);
            tft.drawString(msg, 2, 0);
            uiFontOff();

            bool ok = connectWiFi(selSsid, pass);

            if (ok) {
                insertWifiCred(selSsid, pass);
                return;  // connected — setup() continues to selectModel()
            }

            // --- Failed: offer re-enter or new scan ---
            uint16_t failBg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillScreen(failBg);
            uiFontOn();
            tft.setTextColor(TFT_RED, failBg);
            char failMsg[64]; snprintf(failMsg, sizeof(failMsg), "Failed: %.40s", selSsid);
            tft.drawString(failMsg, 2, (AP_ROW_H - TXT_H) / 2);

            // Draw two option rows (same style as AP list)
            static const char* opts[] = { "1  Re-enter password", "2  New scan" };
            for (int i = 0; i < 2; i++) {
                int y = AP_ROW_H * (i + 1);
                tft.fillRect(0, y, SCREEN_W, AP_ROW_H - 1, COL_KEY_FACE);
                tft.setTextColor(COL_KEY_LABEL, COL_KEY_FACE);
                tft.drawString(opts[i], 2, y + (AP_ROW_H - TXT_H) / 2);
            }
            uiFontOff();

            // Wait for key 1 or 2
            int choice = 0;
            while (choice == 0) {
                InputEvent ev;
                if (!halPollInput(&ev)) { delay(10); continue; }
                if (ev.type == INPUT_CHAR && ev.ch == '1') choice = 1;
                if (ev.type == INPUT_CHAR && ev.ch == '2') choice = 2;
            }

            if (choice == 2) break;  // break inner loop → outer re-scan loop
            // choice == 1: clear stored pass, loop inner (enterPassword runs next iteration)
            clearWifiPass(selSsid);
        }
    }
}

