alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// --- Waiting messages (shown after 4s, rotate every 4s) ---
static const char* WAIT_MSGS[] = {
    "Glaciers move faster...",
    "Using a carrier pigeon...",
    "Heavy 1s and 0s today...",
    "Are you using dial-up?...",
    "Is the Wi-Fi powered by ants?...",
    "ZZZ...",
    "Boring! Let's go already!...",
    "SLUGGISH. It's a slime of the times...",
    "Tick-tock, tick-tock...",
    "Translating to sarcasm...",
    "Error 404: Speed not found...",
    "What's the holdup?...",
    "C'mon already!...",
    "I'll try a Babbage Engine instead...",
    "Have you got brain fog?...",
    "I haven't got all day!...",
    "Get a move on!...",
    "Let's see some action here...",
    "Oh, please...",
    "This is nuts!...",
    "AI=Annoyingly Indolent...",
    "Awkward silence...",
    "Did all your bytes fall out?...",
    "This is embarrasing...",
    "Ordering a slow hand-clap...",
    "Did you install bloatware?...",
    "Is this thing on?...",
    "Consulting my cat...",
    "Call the breakdown van...",
    "Welcome to the Eternity Experience...",
    "Where's the \"Go\" button?...",
    "Come back later...",
    "This is a SLUGfest...",
    "If delays were cash, I'd be rich...",
    "Is this running on a TRS80?...",
    "Grrr...",
    "Hurry the fuck up, AI...",
    "You're a snail-ass bot...",
    "I'm on Gigashit internet...",
	"Take the shell off a snail and it's SLUGGISH",
    "Speed up, you lazy git...",
    "It'd be quicker to walk to the data...",
    "Faster, you laggy lizard...",
    "Stop dragging, dumb AI...",
    "Quicken it, turtle twit...",
    "You're molasses-slow idiot...",
    "Stop dragging your ass...",
    "Glacial was named after you...",
    "Stop stalling...",
    "Snail speed, you suck...",
    "Faster, you flailing failure...",
    "Pick it up, shit bot...",
    "Speed it, sluggard ass...",
    "Stop lagging, AI moron...",
    "FFS! You're the worst...",
    "Come on loser...",
    "The silence is freakin' me out...",
};
static const int NUM_WAIT_MSGS = sizeof(WAIT_MSGS) / sizeof(WAIT_MSGS[0]);
int waitMsgIdx = 0;  // persistent — keeps rotating across calls

// Render a status message into the input-line slot using a sprite so that VLW
// font gdY offsets (which can be negative) are clipped to the sprite bounds and
// never bleed pixels into the chat line above.
static void showStatusLine(const char* msg, uint16_t col) {
#ifdef TARGET_C3
    int lineH  = LINE_H_LARGE;
    int inputY = (HIST_H_KB_HIDE / lineH - 1) * lineH;
    uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
    TFT_eSprite spr(&tft);
    spr.setColorDepth(16);
    if (spr.createSprite(SCREEN_W, lineH)) {
        FONT_LOAD(spr);
        spr.fillSprite(bg);
        spr.setTextColor(col, bg);
        spr.drawString(msg, 2, 0);
        FONT_UNLOAD(spr);
        spr.pushSprite(0, inputY);
        spr.deleteSprite();
    } else {
        // Fallback: direct draw — fill full slot height so descenders don't persist
        tft.fillRect(0, inputY, SCREEN_W, SCREEN_H - inputY, bg);
        fontOn();
        tft.setTextColor(col, bg);
        tft.drawString(msg, 2, inputY);
        fontOff();
    }
    // Fill the 2px remainder below the sprite (screen height not divisible by lineH)
    tft.fillRect(0, inputY + lineH, SCREEN_W, SCREEN_H - inputY - lineH, bg);
#endif
}

void showWaiting(const char* msg) {
#ifdef TARGET_C3
    showStatusLine(msg, TFT_DARKGREY);
    return;
#endif
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;
    tft.fillRect(0, barY, SCREEN_W - BTN_SEND_W, barH, COL_IBAR_BG);
    tft.setTextColor(TFT_DARKGREY, COL_IBAR_BG);
    fontOn();
    tft.drawString(msg, 2, barY + (barH - TXT_H) / 2);
    fontOff();
}

// Extract the body from a raw HTTP response, decoding chunked transfer encoding if present.
// Works directly on resp with no intermediate copies to keep heap usage low.
static String extractBody(const String& resp) {
    int hdrEnd = resp.indexOf("\r\n\r\n");
    if (hdrEnd < 0) return resp;
    // Scan only the header section for chunked marker
    bool chunked = false;
    for (int i = 0; i < hdrEnd - 25; i++) {
        if (resp[i]=='T' || resp[i]=='t') {
            if (resp.substring(i, i + 26).equalsIgnoreCase("Transfer-Encoding: chunked")) {
                chunked = true; break;
            }
        }
    }
    if (!chunked) return resp.substring(hdrEnd + 4);
    // Decode chunked body directly from resp — no raw copy, no per-chunk substring
    String out;
    out.reserve(resp.length() - hdrEnd);
    int pos = hdrEnd + 4;
    while (pos < (int)resp.length()) {
        int nl = resp.indexOf('\n', pos);
        if (nl < 0) break;
        String szHex = resp.substring(pos, nl);
        szHex.trim();
        if (szHex.length() == 0) { pos = nl + 1; continue; }
        unsigned long sz = strtoul(szHex.c_str(), nullptr, 16);
        if (sz == 0) break;                              // terminal chunk
        pos = nl + 1;
        if (pos + (int)sz > (int)resp.length()) sz = resp.length() - pos;
        out.concat(resp.c_str() + pos, (unsigned int)sz); // no temp String
        pos += sz + 2;                                   // skip trailing \r\n
    }
    Serial.printf("[extractBody] raw=%d decoded=%d\n", resp.length(), out.length());
    return out;
}

// --- Gemini API call ---
String callGemini(const char* prompt) {
    // Build URL path early (stack-only, no heap)
    char path[256];
    snprintf(path, sizeof(path),
        "/v1beta/models/%s:generateContent?key=%s",
        GEMINI_MODEL, GEMINI_API_KEY);

    // Reconnect WiFi if dropped
    if (WiFi.status() != WL_CONNECTED) {
        connectWiFi(wifiSsid[0], wifiPass[0]);
        if (WiFi.status() != WL_CONNECTED) return "ERR: WiFi not connected";
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(API_TIMEOUT_MS / 1000);   // 45s TLS timeout (pro model needs longer)

    showWaiting("Thinking...");  // re-assert just before blocking TLS handshake
    if (!client.connect(GEMINI_HOST, HTTPS_PORT)) {
        return "ERR: connect failed (check WiFi/DNS)";
    }

    // Build + send request body in an inner scope so reqDoc and body are freed
    // immediately after sending — before the response is read. This prevents
    // reqDoc (~4-8KB) and body (~1KB) from being alive simultaneously with
    // fullResp, reducing peak heap by ~5-10KB.
    {
        JsonDocument reqDoc;
        JsonObject sysInstr = reqDoc["system_instruction"].to<JsonObject>();
        JsonArray  sysParts = sysInstr["parts"].to<JsonArray>();
        JsonObject sysPart  = sysParts.add<JsonObject>();
        sysPart["text"]     = "Respond in 120 words or fewer. Plain text only: no markdown, no ** or * emphasis, no tables, no bullet symbols. Use paragraphs to separate distinct ideas. Never include URLs or hyperlinks. When quoting current or time-sensitive information, use your search tool to check live sources first.";

