alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    String fullResp;
    uint8_t rbuf[256];
    unsigned long deadline  = millis() + API_TIMEOUT_MS;
    unsigned long nextMsgMs = millis() + API_WAIT_FIRST_MS;
    unsigned long lastData  = millis();
    bool receivedAny = false;
    while (millis() < deadline) {
        int n = client.read(rbuf, sizeof(rbuf));
        if (n > 0) {
            lastData = millis();
            receivedAny = true;
            fullResp.concat((const char*)rbuf, n);
            continue;
        }
        if (receivedAny && !client.connected()) break;
        if (receivedAny && millis() - lastData > 1000) break;
        if (!receivedAny && millis() - lastData > 15000) break;
        if (WiFi.status() != WL_CONNECTED) break;
        if (millis() >= nextMsgMs) {
            showWaiting(WAIT_MSGS[waitMsgIdx]);
            waitMsgIdx = (waitMsgIdx + 1) % NUM_WAIT_MSGS;
            nextMsgMs += 6000;
        }
#ifndef TARGET_C3
        pollKBHide();
#endif
        delay(10);
    }
    client.stop();
    Serial.printf("[Groq] response len=%d\n", fullResp.length());

    if (fullResp.length() == 0) return "ERR: empty response";

    // Parse HTTP status
    int httpStatus = 200;
    if (fullResp.startsWith("HTTP/")) {
        int sp = fullResp.indexOf(' ');
        if (sp > 0) httpStatus = fullResp.substring(sp + 1, sp + 4).toInt();
    }

    int jsonStart = fullResp.indexOf('{');
    if (jsonStart < 0) return "ERR: no JSON in response";
    Serial.println("[Groq] JSON body: " + fullResp.substring(jsonStart, jsonStart + 400));

    if (httpStatus != 200) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: HTTP %d (see serial)", httpStatus);
        return String(buf);
    }

    JsonDocument respDoc;
    if (deserializeJson(respDoc, fullResp.c_str() + jsonStart) != DeserializationError::Ok) {
        Serial.println("Bad JSON: " + fullResp.substring(jsonStart, jsonStart + 200));
        return "ERR: JSON parse failed";
    }

    const char* errMsg = respDoc["error"]["message"];
    if (errMsg) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: %.72s", errMsg);
        return String(buf);
    }

    // OpenAI-compatible: choices[0].message.content
    const char* text = respDoc["choices"][0]["message"]["content"];
    if (text) return String(text);

    return "ERR: no text in response";
}

// --- Send flow ---
void showThinking() {
#ifdef TARGET_C3
    showStatusLine("Thinking...", TFT_DARKGREY);
    return;
#endif
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;
    tft.fillRect(0, barY, SCREEN_W - BTN_SEND_W, barH, COL_IBAR_BG);
    tft.setTextColor(TFT_DARKGREY, COL_IBAR_BG);
    fontOn();
    tft.drawString("Thinking...", 2, barY + (barH - TXT_H) / 2);
    fontOff();
}

void sendPrompt() {
    char prompt[128];
    if (inputLen == 0) {
        if (historyCount == 0) return;  // no conversation yet — ignore
        strncpy(prompt, "Tell me more", 127);
    } else {
        strncpy(prompt, inputBuf, 127);
        inputBuf[0] = '\0';
        inputLen    = 0;
    }
    prompt[127] = '\0';
    moreMode = false;
#ifndef TARGET_C3
    kbVisible = false;   // hide KB; drawHistory() covers the KB area
#endif
    drawInputBar();      // clear full bar now — erases BS/Hide key remnants before API wait

    // Show user message and thinking indicator
    addMessage(true, false, prompt);
    showThinking();

    // Call API — deinit NimBLE on C3 to free ~30KB heap for TLS buffers.
    halBeforeApiCall();
    if (WiFi.status() != WL_CONNECTED) {
        WiFi.reconnect();
        for (int i = 0; i < 50 && WiFi.status() != WL_CONNECTED; i++) delay(100);
    }
    String response = useGroq ? callGroq(prompt) : (useGrok ? callGrok(prompt) : callGemini(prompt));
    // Retry once on empty response (transient WiFi disruption after NimBLE deinit on C3)
    if (response == "ERR: empty response") {
        if (WiFi.status() != WL_CONNECTED) WiFi.reconnect();
        for (int i = 0; i < 50 && WiFi.status() != WL_CONNECTED; i++) delay(100);
        response = useGroq ? callGroq(prompt) : (useGrok ? callGrok(prompt) : callGemini(prompt));
    }
    halAfterApiCall();

    if (response.startsWith("ERR:")) {
        addMessage(false, true, response.c_str());
    } else {
        addMessage(false, false, response.c_str());
    }

    moreMode = true;   // after every reply, offer "More"
    wifiHealthy = (WiFi.status() == WL_CONNECTED);  // refresh after API call; LED uses RSSI independently
    drawInputBar();
}

#ifndef TARGET_C3
void drawCrosshair(int x, int y) {
    tft.drawLine(x - 18, y, x + 18, y, TFT_WHITE);
    tft.drawLine(x, y - 18, x, y + 18, TFT_WHITE);
    tft.drawCircle(x, y, 6, TFT_WHITE);
}
#endif

#ifdef TARGET_C3
// Draw one line of text as a sprite to avoid C3 per-glyph SPI glitches.
static void c3Line(int y, const char* text, uint16_t col, uint16_t bg) {
    int lineH = LINE_H_LARGE;
    TFT_eSprite spr(&tft);
    spr.setColorDepth(16);
    if (spr.createSprite(SCREEN_W, lineH)) {
        FONT_LOAD(spr);
        spr.fillSprite(bg);
        spr.setTextColor(col, bg);
        spr.drawString(text, 2, 0);
        FONT_UNLOAD(spr);
        spr.pushSprite(0, y);
        spr.deleteSprite();
    }
}
#endif

void showModelChoices() {
    uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
    uint16_t fg = invertDisplay ? TFT_BLACK : TFT_WHITE;
#ifdef TARGET_C3
    int optY = 2 * LINE_H_LARGE;
    c3Line(optY, "1 Gemini 2.5 Flash", fg, bg); optY += LINE_H_LARGE;
    c3Line(optY, "2 Gemini 3 Flash",   fg, bg); optY += LINE_H_LARGE;
    c3Line(optY, "3 Gemini 3.1 Pro",   fg, bg); optY += LINE_H_LARGE;
    c3Line(optY, "4 Grok 4.1 Fast",    fg, bg); optY += LINE_H_LARGE;
    c3Line(optY, "5 Groq OSS-120b",    fg, bg); optY += LINE_H_LARGE;
    if (invertDisplay)
        c3Line(optY, "D Dark Theme",   fg, bg);
#else
    uiFontOn();
    tft.setTextColor(fg, bg);
    int optY = 2 * TXT_H + 4;  // start below the two header lines
    tft.drawString("1 Gemini 2.5 Flash", 2, optY); optY += TXT_H;
    tft.drawString("2 Gemini 3 Flash",   2, optY); optY += TXT_H;
    tft.drawString("3 Gemini 3.1 Pro",   2, optY); optY += TXT_H;
    tft.drawString("4 Grok 4.1 Fast",    2, optY); optY += TXT_H;
    tft.drawString("5 Groq OSS-120b",    2, optY); optY += TXT_H;
    if (invertDisplay)
        tft.drawString("D Dark Theme",   2, optY);
    uiFontOff();
#endif
}

