alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
void selectModel() {
    static const char* modelIds[]    = {
        "gemini-2.5-flash",
        "gemini-3-flash-preview",
        "gemini-3.1-pro-preview"
    };
    static const bool  modelGlobal[] = { true, true, false };

    showModelChoices();

    while (true) {
        InputEvent ev;
        if (!halPollInput(&ev)) { delay(10); continue; }
        if (ev.type != INPUT_CHAR) continue;
        char ch = ev.ch;

        // Models 1–3 (Gemini)
        if (ch >= '1' && ch <= '3') {
            int i = ch - '1';
            halClickSound();
            strncpy(GEMINI_MODEL, modelIds[i], 47); GEMINI_MODEL[47] = '\0';
            geminiUseGlobal = modelGlobal[i];
            useGrok = false; useGroq = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            int clearH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
            tft.fillRect(0, 0, SCREEN_W, clearH, bg);
#ifdef TARGET_C3
            c3Line(0,                "Cheap AI Chat Keyboard", TFT_GREEN,    bg);
            c3Line(LINE_H_LARGE,     GEMINI_MODEL,             TFT_GREEN,    bg);
            c3Line(2 * LINE_H_LARGE, "Ready.",                 TFT_DARKGREY, bg);
#else
            uiFontOn();
            tft.setTextColor(TFT_GREEN, bg);
            tft.drawString("Cheap AI Chat Keyboard", 2, 0);
            tft.drawString(GEMINI_MODEL, 2, LINE_H_LARGE);
            tft.setTextColor(TFT_DARKGREY, bg);
            tft.drawString("Ready.", 2, 2 * LINE_H_LARGE);
            uiFontOff();
#endif
            return;
        }
        if (ch == '4') {
            halClickSound();
            useGrok = true; useGroq = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            int clearH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
            tft.fillRect(0, 0, SCREEN_W, clearH, bg);
#ifdef TARGET_C3
            c3Line(0,                "Cheap AI Chat Keyboard", TFT_GREEN,    bg);
            c3Line(LINE_H_LARGE,     "Grok 4.1 Fast",          TFT_GREEN,    bg);
            c3Line(2 * LINE_H_LARGE, "Ready.",                 TFT_DARKGREY, bg);
#else
            uiFontOn();
            tft.setTextColor(TFT_GREEN, bg);
            tft.drawString("Cheap AI Chat Keyboard", 2, 0);
            tft.drawString("Grok 4.1 Fast", 2, LINE_H_LARGE);
            tft.setTextColor(TFT_DARKGREY, bg);
            tft.drawString("Ready.", 2, 2 * LINE_H_LARGE);
            uiFontOff();
#endif
            return;
        }
        if (ch == '5') {
            halClickSound();
            useGroq = true; useGrok = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            int clearH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
            tft.fillRect(0, 0, SCREEN_W, clearH, bg);
#ifdef TARGET_C3
            c3Line(0,                "Cheap AI Chat Keyboard", TFT_GREEN,    bg);
            c3Line(LINE_H_LARGE,     "Groq GPT-OSS-120b",      TFT_GREEN,    bg);
            c3Line(2 * LINE_H_LARGE, "Ready.",                 TFT_DARKGREY, bg);
#else
            uiFontOn();
            tft.setTextColor(TFT_GREEN, bg);
            tft.drawString("Cheap AI Chat Keyboard", 2, 0);
            tft.drawString("Groq GPT-OSS-120b", 2, LINE_H_LARGE);
            tft.setTextColor(TFT_DARKGREY, bg);
            tft.drawString("Ready.", 2, 2 * LINE_H_LARGE);
            uiFontOff();
#endif
            return;
        }
        if (ch == 'd' || ch == 'D') {
            invertDisplay = !invertDisplay;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillScreen(bg);
            drawInputBar();
#ifdef TARGET_C3
            c3Line(0,            "Cheap AI Chat Keyboard", invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
            c3Line(LINE_H_LARGE, "Select AI model:",       invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
#else
            uiFontOn(); tft.setTextColor(invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
            tft.drawString("Cheap AI Chat Keyboard", 2, 0);
            tft.drawString("Select AI model:",       2, TXT_H + 4);
            uiFontOff();
#endif
            showModelChoices();
            continue;
        }
#ifndef TARGET_C3
        if (ch == 'c' || ch == 'C') {
            calibrateTouch();
            tft.fillScreen(COL_BG);
            uiFontOn(); tft.setTextColor(TFT_DARKGREY, COL_BG);
            tft.drawString("Cheap AI Chat Keyboard", 2, 0);
            tft.drawString("Select AI model:",       2, TXT_H);
            uiFontOff();
            drawKeyboard();
            drawInputBar(); showModelChoices();
            continue;
        }
#endif
    }
}

void setup() {
    loadWifiCreds();   // load NVS; shows AP picker on first boot if no credentials stored

#ifndef TARGET_C3
    // Hold BOOT button (GPIO0) on power-on to wipe touch calibration back to defaults
    pinMode(0, INPUT_PULLUP);
    if (digitalRead(0) == LOW) {
        Preferences p;
        p.begin("touch", false);
        p.remove("valid");
        p.remove("orient");
        p.end();
        Serial.begin(115200);
        Serial.println("[Cal] Reset to defaults via BOOT button");
        delay(500);
    }
#endif
    Serial.begin(115200);
#ifndef TARGET_C3
    Serial.println("[Cal] Loaded touch calibration from NVS");
#endif
    waitMsgIdx = random(NUM_WAIT_MSGS);
    // Display (init before backlight to avoid white flash)
    tft.init();
#ifdef TARGET_C3
    // ST7789 GRAM is 240col x 320row (portrait-native). Pre-fill all GRAM in
    // rotation 0 (CASET 0..239, RASET 0..319 both valid) so that GRAM rows
    // 240..319 contain COL_BG rather than power-on white. Without this, those
    // rows map to a visible white strip in some landscape rotations.
    tft.setRotation(0);
    tft.fillScreen(COL_BG);  // writes all 240x320 GRAM cells
    tft.setRotation(1);      // MX|MV landscape: correct physical orientation
    Serial.printf("[TFT] width=%d height=%d (expect %dx%d)\n", tft.width(), tft.height(), SCREEN_W, SCREEN_H);
#else
    #ifdef ROTATE_180
        tft.setRotation(3);
    #else
        tft.setRotation(1);
    #endif
#endif
    tft.fillScreen(invertDisplay ? COL_INVERT_BG : COL_BG);

